Revit 2017 API
RuledSurface Properties
The RuledSurface type exposes the following members.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from Surface.)
See Also
RuledSurface Class
Autodesk.Revit.DB Namespace